# **4.27_clean_data_index&columns**

In [1]:
import pandas as pd

### 一、 重命名索引和列名(使用字典)

DataFrame的rename方法，rename方法会返回一个新的DataFrame

适用于列名或索引数量少的情况

In [8]:
df1 = pd.read_csv('example1.csv', index_col=0)
df1

   客户_姓名 客户 性别  age                    邮箱
1     李十     女   58  yVaQXekW@example.com
2_    冯三     男   27  LctXbrEM@example.com
3     吴十     男   32  UyTYBzUZ@example.com
4     王十     女   58  KCixgciF@example.com
_5    钱十     女   27  nqRBXOtA@example.com
6*    赵八     女   51  GyKwILAL@example.com

#### (一)、重命名索引

 放入可选参数index，并赋值为一个字典。

 字典中，把需要修改的老的名字作为键，把对应的新的名字作为值。

In [9]:
df1 = df1.rename(index={'2_': '2', '_5': '5', '6*': '6'})
df1

  客户_姓名 客户 性别  age                    邮箱
1    李十     女   58  yVaQXekW@example.com
2    冯三     男   27  LctXbrEM@example.com
3    吴十     男   32  UyTYBzUZ@example.com
4    王十     女   58  KCixgciF@example.com
5    钱十     女   27  nqRBXOtA@example.com
6    赵八     女   51  GyKwILAL@example.com

#### (二)、重命名列名

放入可选参数columns，并赋值为一个字典

字典中，把需要修改的老的名字作为键，把对应的新的名字作为值。

In [11]:
df1 = df1.rename(columns={'客户_姓名': '客户姓名', '客户 性别': '客户性别', 'age': '客户年龄', '邮箱': '客户邮箱'})
df1

  客户姓名 客户性别  客户年龄                  客户邮箱
1   李十    女    58  yVaQXekW@example.com
2   冯三    男    27  LctXbrEM@example.com
3   吴十    男    32  UyTYBzUZ@example.com
4   王十    女    58  KCixgciF@example.com
5   钱十    女    27  nqRBXOtA@example.com
6   赵八    女    51  GyKwILAL@example.com

### 二、重命名索引和列名(函数/方法)

rename方法，除了传入字典，还可以传入一个针对Series的函数或方法，可以是Pandas库里面的，也可以是我们自行定义的

```python
df2.rename(index=函数/方法)
df2.rename(columns=函数/方法)
```

这个函数/方法会把原本索引或列名作为参数，然后返回新的名字。

举个例子:

#### (一)、把所有列名变成大写

可以给columns这个可选参数，传入str.upper方法

str是Series类自带的一个属性，会返回一个包含了很多字符串相关操作方法的,StringMethods类的实例(返回实例才可以调用方法)，对这个StringMethods实例调用upper方法，就会把Series里所有字符变成大写。

In [20]:
s1 = pd.Series(["hello", "this", "is", "Zheng"])
s1

0    hello
1     this
2       is
3    Zheng
dtype: object

In [21]:
s1.str

In [22]:
s1.str.upper()

0    HELLO
1     THIS
2       IS
3    ZHENG
dtype: object

作为columns参数的值，传给rename，执行后就会返回一个列名全变成了大写的DataFrame

In [23]:
df2 = pd.read_csv("example2.csv")
df2

         Date  Amount Salesperson       Location
0  2022-01-01    1000       Alice       New York
1  2022-01-02    1500         Bob  San Francisco
2  2022-01-03     800     Charlie       New York
3  2022-01-04    1200       David  San Francisco

In [24]:
df2.rename(columns=str.upper)

         DATE  AMOUNT SALESPERSON       LOCATION
0  2022-01-01    1000       Alice       New York
1  2022-01-02    1500         Bob  San Francisco
2  2022-01-03     800     Charlie       New York
3  2022-01-04    1200       David  San Francisco

#### (二)、其他操作

1. 如果想了解其它对字符串Series调用的方法，可以查看Pandas官方文档

   像这些所有以pandas.Series.str开头的，都是可以用在Pandas Series上的字符串操作

    所有Series的方法相关文档:

   https://pandas.pydata.org/docs/reference/api/pandas.Series.html

2. 所有DataFrame的方法相关文档:

   https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html

3. Pandas 官万文档: https://pandas.pydata.org/docs/reference

   里面有所有 Pandas 库里面的类、类方法、类属性介绍等等。包括Series、DataFrame等

### 三、设置索引

#### (一)、把某列设为索引

set_index方法，可以直接把某列属性的值用来作为索引，里面直接传入列名，会返回一个新的DataFrame，其索引变成了那列的值

In [28]:
df3 = df2.set_index('Salesperson')
df3

                   Date  Amount       Location
Salesperson
Alice        2022-01-01    1000       New York
Bob          2022-01-02    1500  San Francisco
Charlie      2022-01-03     800       New York
David        2022-01-04    1200  San Francisco

#### (二)、重置索引

reset_index方法，相当于做的和set_index相反的事，即把索引重设为初始默认的位置索引，并且把原本作为index的值变成单独一列

In [29]:
df3.reset_index()

  Salesperson        Date  Amount       Location
0       Alice  2022-01-01    1000       New York
1         Bob  2022-01-02    1500  San Francisco
2     Charlie  2022-01-03     800       New York
3       David  2022-01-04    1200  San Francisco

### 四、对索引和列名重新排序

sort_index方法，适用于数据的索引或列名符合要求，但它的顺序是乱的情况

In [32]:
df4 = pd.read_csv('example3.csv', index_col=0)
df4

  客户姓名 客户性别  客户年龄                  客户邮箱
a   李十    女    58  yVaQXekW@example.com
c   冯三    男    27  LctXbrEM@example.com
b   吴十    男    32  UyTYBzUZ@example.com
e   王十    女    58  KCixgciF@example.com
d   钱十    女    27  nqRBXOtA@example.com
f   赵八    女    51  GyKwILAL@example.com

#### (一)、对索引进行排序

默认axis=0,沿着索引纵向操作，对索引排序

In [35]:
df4 = df4.sort_index()
df4

  客户姓名 客户性别  客户年龄                  客户邮箱
a   李十    女    58  yVaQXekW@example.com
b   吴十    男    32  UyTYBzUZ@example.com
c   冯三    男    27  LctXbrEM@example.com
d   钱十    女    27  nqRBXOtA@example.com
e   王十    女    58  KCixgciF@example.com
f   赵八    女    51  GyKwILAL@example.com

#### (二)、对列名进行排序

指定axis=1,沿着列名纵向操作，对列名排序

In [36]:
df4.sort_index(axis=1)

  客户姓名  客户年龄 客户性别                  客户邮箱
a   李十    58    女  yVaQXekW@example.com
b   吴十    32    男  UyTYBzUZ@example.com
c   冯三    27    男  LctXbrEM@example.com
d   钱十    27    女  nqRBXOtA@example.com
e   王十    58    女  KCixgciF@example.com
f   赵八    51    女  GyKwILAL@example.com

### 五、可选参数inplace

适用于rename、set_index、reset_index、sort_index方法

传入'inplace=True'，表示直接原地修改原始DataFrame，就不用进行赋值了；并且此时方法不返回新的DataFrame，如果赋值给变量，则变量变为空值